[
    {
        "id": "dhikr_001",
        "arabic": "سُبْحَانَ اللّٰه، الْـحَمْـدُ للهِ، لَا إِلٰهَ إِلَّا اللّٰه، اللَّهُ أَكْبَرُ",
        "transliteration": "Subḥānallāh, Al-ḥamdu lillāh, Lā ilāha illā Allāh, Allāhu Akbar",
        "references": [
            {
                "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying: The uttering of (these words): 'Exalted is Allah (He is free from imperfection), all praise is due to Allah, there is no god but Allah, and Allah is the Greatest,' is dearer to me than anything over which the sun rises.",
                "source": "Sahih Muslim 2695"
            }
        ]
    },
    {
        "id": "dhikr_002",
        "arabic": "أَسْتَغْفِرُ اللّٰهَ",
        "transliteration": "Astaghfirullāh",
        "references": [
            {
                "text": "And said, 'Ask forgiveness of your Lord. Indeed, He is ever a Perpetual Forgiver. He will send [rain from] the sky upon you in [continuing] showers, and give you increase in wealth and children and provide for you gardens and provide for you rivers.'",
                "source": "Surah Nuh 71:10-12"
            }
        ]
    },
    {
        "id": "dhikr_003",
        "arabic": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ",
        "transliteration": "Lā ḥawla wa lā quwwata illā billāh",
        "references": [
            {
                "text": "It was narrated that Abu Dharr said: 'The Messenger of Allah (saas) said to me: \"Shall I not tell you of a treasure which is one of the treasures of Paradise?\" I said: 'Yes, O Messenger of Allah.' He said: 'La hawla wa la quwwata illa billah (There is no power and no strength except with Allah).'",
                "source": "Sunan Ibn Majah 3825"
            }
        ]
    },
    {
        "id": "dhikr_004",
        "arabic": "اللَّهُمَّ صَلِّ عَلَىٰ مُحَمَّدٍ وَعَلَىٰ آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَىٰ إِبْرَاهِيْمَ وَعَلَىٰ آلِ إِبْرَاهِيْمَ، إِنَّكَ حَمِيدٌ مَّجِيدٌ، اللَّهُمَّ بَارِكْ عَلَىٰ مُحَمَّدٍ وَعَلَىٰ آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَىٰ إِبْرَاهِيْمَ وَعَلَىٰ آلِ إِبْرَاهِيْمَ، إِنَّكَ حَمِيدٌ مَّجِيدٌ",
        "transliteration": "Allāhumma ṣalli ʿalā Muḥammad wa ʿalā āli Muḥammad, kamā ṣallayta ʿalā Ibrāhīm wa ʿalā āli Ibrāhīm, innaka ḥamīdun majīd. Allāhumma bārik ʿalā Muḥammad wa ʿalā āli Muḥammad, kamā bārakta ʿalā Ibrāhīm wa ʿalā āli Ibrāhīm, innaka ḥamīdun majīd.",
        "references": [
            {
                "text": "Anas bin Malik said: 'The Messenger of Allah (ﷺ) said: 'Whoever sends salah upon me once, Allah (SWT) will send salah upon him tenfold, and will erase ten sins from him, and will raise him ten degrees in status.'",
                "source": "Sunan an-Nasa'i 1297"
            }
        ]
    },
    {
        "id": "dhikr_005",
        "arabic": "لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيْرٌ",
        "transliteration": "Lā ilāha illā Allāhu waḥdahu lā sharīka lah, lahu al-mulku wa lahu al-ḥamdu wa huwa ʿalā kulli shay’in qadīr",
        "references": [
            {
                "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying: He who uttered these words: 'There is no god but Allah, the One, having no partner with Him. Sovereignty belongs to Him and all the praise is due to Him, and He is Potent over everything' one hundred times every day there is a reward of emancipating ten slaves for him, and there are recorded hundred virtues to his credit, and hundred vices are blotted out from his scroll, and that is a safeguard for him against the Satan on that day till evening and no one brings anything more excellent than this, except one who has done more than this (who utters these words more than one hundred times and does more good acts). And he who utters: 'Exalted is Allah (He is free from imperfection), and all praise is due to Him,' one hundred times a day, his sins are obliterated even if they are equal to the extent of the foam of the ocean.",
                "source": "Sahih Muslim 2691"
            }
        ]
    },
    {
        "id": "dhikr_006",
        "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيم",
        "transliteration": "Subḥānallāhi wa biḥamdih, Subḥānallāhil-ʿAẓīm",
        "references": [
            {
                "text": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, \"(The following are) two words (sentences or utterances) that are very easy for the tongue to say, and very heavy in the balance (of reward), and most beloved to the Gracious Almighty (And they are): Subhan Allahi wa bi-hamdihi; Subhan Allahi-l-'Adhim.\"",
                "source": "Sahih al-Bukhari 6682"
            }
        ]
    },
    {
        "id": "dhikr_007",
        "arabic": "يَا حَيُّ يَا قَيُّوْمُ، بِرَحْمَتِكَ أَسْتَغِيْثُ",
        "transliteration": "Yā Ḥayy Yā Qayyūm, bi-raḥmatika astaghīth",
        "references": [
            {
                "text": "Anas bin Malik said: 'Whenever a matter would distress him, the Prophet (ﷺ) would say: ‘O Living, O Self-Sustaining Sustainer! In Your Mercy do I seek relief (Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth).’ And with this chain, that he said: 'The Messenger of Allah (ﷺ) said: ‘Be constant with: “O Possessor of Majesty and Honor (Yā Dhal-Jalāli wal-Ikrām).’",
                "source": "Jami` at-Tirmidhi 3524"
            }
        ]
    },
    {
        "id": "dhikr_008",
        "arabic": "لَآ إِلٰهَ إِلَّآ أَنْتَ سُبۡحٰنَكَ إِنِّيْ كُنْتُ مِنَ الظّٰلِمِيْنَ",
        "transliteration": "Lā ilāha illā Anta subḥānaka innī kuntu min al-ẓālimīn",
        "references": [
            {
                "text": "Ibrahim bin Muhammad bin Sa`d narrated from his father, from Sa`d that the Messenger of Allah (ﷺ) said: 'The supplication of Dhun-Nun (Prophet Yunus) when he supplicated, while in the belly of the whale was: ‘There is none worthy of worship except You, Glory to You, Indeed, I have been of the transgressors. (Lā ilāha illā anta subḥānaka innī kuntu minaẓ-ẓālimīn)’ So indeed, no Muslim man supplicates with it for anything, ever, except Allah responds to him.'",
                "source": "Jami` at-Tirmidhi 3505"
            }
        ]
    },
    {
        "id": "dhikr_009",
        "arabic": "أَسْتَغْفِرُ اللهَ الْعَظِيْمَ الَّذِيْ لَا إِلٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّوْمُ، وَأَتُوْبُ إِلَيْهِ",
        "transliteration": "Astaghfirullāhal-ʿAẓīma alladhī lā ilāha illā huwa al-ḥayyul-qayyūm wa atūbu ilayh",
        "references": [
            {
                "text": "Bilal bin Yasar bin Zaid [the freed slave of the Prophet (ﷺ)] narrated: “My father narrated to me, from my grandfather, that he heard the Prophet (ﷺ) say: ‘Whoever says: “I seek forgiveness from Allah, the Magnificent, whom there is none worthy of worship but Him, the Living, Al-Qayyum, and I repent to him,” (Astaghfirullāhal-`Aẓīm alladhī lā ilāha illā huwal-Ḥayyul-Qayyūmu wa atūbu ilaih) then Allah will forgive him, even if he fled from battle.’”",
                "source": "Jami` at-Tirmidhi 3577"
            }
        ]
    },
    {
        "id": "dhikr_010",
        "arabic": "اللَّهُمَّ أَنتَ رَبِّي لَا إِلٰهَ إِلَّا أَنتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِن شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنبِي، فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنتَ",
        "transliteration": "Allāhumma anta Rabbī lā ilāha illā anta, khalaqtanī wa anā ʿabduk, wa anā ʿalā ʿahdika wa waʿdika ma istaṭaʿtu, aʿūdhu bika min sharri mā ṣanaʿtu, abū’u laka biniʿmatika ʿalayya, wa abū’u laka bidhanbī, faghfir lī fa’innahu lā yaghfiru al-dhunūba illā anta",
        "references": [
            {
                "text": "Narrated Shaddad bin Aus: The Prophet (ﷺ) said, 'The most superior way of asking for forgiveness from Allah is to say: [O Allah, You are my Lord…]. If somebody recites it during the day with firm faith in it, and dies on the same day before the evening, he will be from the people of Paradise; and if somebody recites it at night with firm faith in it, and dies before the morning, he will be from the people of Paradise.'",
                "source": "Sahih al-Bukhari 6306"
            }
        ]
    },
    {
        "id": "dhikr_011",
        "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَاهُ نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
        "transliteration": "Subḥānallāhi wa biḥamdih ʿadada khalqihi wa riḍāhu nafsihi wa zinata ʿarshihi wa midāda kalimātihi",
        "references": [
            {
                "text": "Juwairiyah bint Al-Harith (May Allah be pleased with her), the Mother of the Believers, reported: The Prophet (ﷺ) came out from my apartment in the morning as I was busy in performing the dawn prayer. He came back in the forenoon and found me sitting there. The Prophet (ﷺ) said, 'Are you still in the same position as I left you?' I replied in the affirmative. Thereupon the Prophet said, 'I recited four words three times after I had left you. If these are to be weighed against all you have recited since morning, these will be heavier. These are: Subhan-Allahi wa bihamdihi, `adada khalqihi, wa rida nafsihi, wa zinatah `arshihi, wa midada kalimatihi.'",
                "source": "Riyad as-Salihin 1433"
            }
        ]
    },
    {
        "id": "dhikr_012",
        "arabic": "بِإِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ",
        "transliteration": "Rabbi innī limā anzalta ilayya min khayrin faqīr",
        "references": [
            {
                "text": "So he watered [their flocks] for them; then he went back to the shade and said, 'My Lord, indeed I am, for whatever good You would send down to me, in need.'",
                "source": "Surah Al-Qasas 28:24"
            }
        ]
    },
    {
        "id": "dhikr_013",
        "arabic": "إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ",
        "transliteration": "Innā ma'iyyā rabbī sayahdīn",
        "references": [
            {
                "text": "[Moses] said, 'No! Indeed, with me is my Lord; He will guide me.'",
                "source": "Surah Ash-Shu'ara 26:62"
            }
        ]
    },
    {
        "id": "dhikr_014",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ",
        "transliteration": "Allāhumma innī aʿūdhu bika min al-hammi wa al-ḥazan, wa aʿūdhu bika min al-ʿajzi wa al-kasali wa aʿūdhu bika min al-jubni wa al-bukhli wa aʿūdhu bika min ghalabatī al-dayn wa qahri al-rijāl",
        "references": [
            {
                "text": "O Allah! I seek refuge with You from worry and grief, from incapacity and laziness, from cowardice and miserliness, from being heavily in debt and from being overpowered by (other) men.",
                "source": "Sahih al-Bukhari 6369"
            }
        ]
    },
    {
        "id": "dhikr_015",
        "arabic": "اللّهُمَّ اكْفِنِي حَلَالَكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
        "transliteration": "Allāhumma kfīnī ḥalālaka ʿan ḥarāmika wa aghnīnī bifaḍlika ‘amman siwāka",
        "references": [
            {
                "text": "Ali [may Allah be pleased with him] narrated: that a Mukatib came to him and said: 'Indeed I am not capable of my Kitabah so aid me.' He said: 'Should I not teach you words that the Messenger of Allah (ﷺ) taught me? If you had a debt upon you similar to the mountain of Sir, Allah would fulfill it for you. He said: 'Say: O Allah, suffice me with Your lawful against Your prohibited, and make me independent of all those besides You.'",
                "source": "Jami` at-Tirmidhi 3563"
            }
        ]
    },
    {
        "id": "dhikr_016",
        "arabic": "رَبِّ اغْفِرْ لِي وَارْحَمْنِي وَاهْدِنِي وَعَافِنِي وَارْزُقْنِي",
        "transliteration": "Rabbī ighfir lī wa arḥamnī wa hdīnī wa ‘āfinī wa ruzuqnī",
        "references": [
            {
                "text": "Tariq bin Ashyam (May Allah be pleased with him) reported: Whenever a man entered the fold of Islam, the Prophet (ﷺ) would show him how to perform Salat and then direct him to supplicate: 'Allahumm-aghfir li, warhamni, wa-hdini, wa 'afini, warzuqni (O Allah! Forgive me, have mercy on me, guide me, guard me against harm and provide me with sustenance and salvation).'",
                "source": "Muslim"
            },
            {
                "text": "In another narration, Tariq said: A man came to the Prophet (ﷺ) and said to him: 'O Messenger of Allah! What shall I say if I want to pray to my Rubb?' He (ﷺ) said, 'Say: Allahumma-ghfir li, warhamni, wa 'afini, warzuqni (O Allah! Forgive me, have mercy on me, protect me and provide me with sustenance). Surely, this supplication is better for you in this life and in the Hereafter.'",
                "source": "Riyad as-Salihin 1469"
            }
        ]
    },
    {
        "id": "dhikr_017",
        "arabic": "رَبَّنَا آتِنا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنا عَذَابَ النَّارِ",
        "transliteration": "Rabbana atina fi d-dunyā ḥasanatan wa fi l-ākhirati ḥasanatan wa qinā ‘adhāb an-nār",
        "references": [
            {
                "text": "The most frequent invocation of The Prophet (ﷺ) was: 'O Allah! Give to us in the world that which is good and in the Hereafter that which is good, and save us from the torment of the Fire.'",
                "source": "Sahih al-Bukhari 6389"
            }
        ]
    },
    {
        "id": "dhikr_018",
        "arabic": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّاب",
        "transliteration": "Rabbana lā tuzīgh quloobana ba‘da idh hadaytana wa hab lana min ladunka raḥmatan innaka anta l-wahhāb",
        "references": [
            {
                "text": "Our Lord, do not let our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower.",
                "source": "Surah Aal-e-Imran 3:8"
            }
        ]
    },
    {
        "id": "dhikr_019",
        "arabic": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي رَبَّنَا تَقَبَّلْ دُعَاءَ",
        "transliteration": "Rabbij 'ilnī muqīmas-ṣalāti wa min dhurriyatī, rabbana taqabbal du'a.",
        "translation": "My Lord, make me an establisher of prayer, and [raise] my descendants. Our Lord, accept [this] prayer.",
        "references": [
            {
                "text": "This supplication was made by Prophet Ibrahim (Abraham) when he prayed to Allah for himself and his descendants to be steadfast in prayer.",
                "source": "Surah Ibrahim 14:40"
            }
        ]
    },
    {
        "id": "dhikr_020",
        "arabic": "رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا",
        "transliteration": "Rabbana la tu'ākhidhnā in naseenā aw akhta'nā.",
        "translation": "Our Lord, do not impose blame upon us if we forget or make a mistake.",
        "references": [
            {
                "text": "Our Lord, do not impose blame upon us if we forget or make a mistake. Allah says: 'I will do that.'",
                "source": "Surah Al-Baqarah 2:286"
            }
        ]
    },
    {
        "id": "dhikr_021",
        "arabic": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلمؤمنينَ يَوْمَ يَقُومُ الْحِسَابِ",
        "transliteration": "Rabbanaghfir lī wa li-wālidayya wa lil-mu’minīn yawma yaqūmul ḥisāb.",
        "translation": "Our Lord, forgive me and my parents and the believers the Day the account is established.",
        "references": [
            {
                "text": "Our Lord, forgive me and my parents and the believers the Day the account is established.",
                "source": "Surah Ibrahim 14:41"
            }
        ]
    },
    {
        "id": "dhikr_022",
        "arabic": "رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحُمْنَا",
        "transliteration": "Rabbana wa la tuḥammilnā mā lā ṭāqata lanā bih wa'fu ‘annā waghfir lanā warḥamnā.",
        "translation": "Our Lord, and do not burden us with that which we have no ability to bear. And pardon us and forgive us and have mercy upon us.",
        "references": [
            {
                "text": "Our Lord, and do not burden us with that which we have no ability to bear. And pardon us and forgive us and have mercy upon us.",
                "source": "Surah Al-Baqarah 2:286"
            }
        ]
    },
    {
        "id": "dhikr_023",
        "arabic": "اللَّهُمَّ رَحْمَتَكَ أَرْجُو، فَلَا تَكِلْنِي إِلَىٰ نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إِلَّا أَنْتَ",
        "transliteration": "Allāhumma raḥmataka arjū, fa-lā takilnī ilā nafsī ṭarfata ʿayn, wa aṣliḥ lī sha’nī kullah, lā ilāha illā anta",
        "translation": "O Allah! Your mercy is what I hope for, so do not leave me in charge of my affairs even for the blink of an eye. And make all of my affairs well-ordered. There is no god but You.",
        "references": [
            {
                "text": "The Messenger of Allah (ﷺ) said: The supplications to be used by one who is distressed are: 'O Allah! Your mercy is what I hope for. Do not abandon me to myself for an instant, but put all my affairs in good order for me. There is no god but You.'",
                "source": "Sunan Abi Dawud 5090"
            }
        ]
    },
    {
        "id": "dhikr_024",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ، لَا إِلَهَ إِلَّا أَنْتَ، الْأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ",
        "transliteration": "Allāhumma innī as’aluka bi-annī ash-hadu annaka antallāh, lā ilāha illā ant, al-aḥad aṣ-ṣamad, alladhī lam yalid wa lam yūlad, wa lam yakun lahu kufuwan aḥad",
        "translation": "O Allah, indeed I ask You by testifying that You are Allah, there is no god but You, the One, the Self-Sufficient, who does not beget nor was He begotten, and there is none comparable to Him.",
        "references": [
            {
                "text": "The Prophet (ﷺ) heard a man supplicating with this and said: 'By the One in Whose Hand is my soul, he has asked Allah by His Greatest Name – the one which, if He is called upon by it, He responds, and when He is asked by it, He gives.'",
                "source": "Jami` at-Tirmidhi 3475"
            }
        ]
    }
]